xmltemplate/request.xml

<s:Envelope xmlns:des="http://DescargaMasivaTerceros.sat.gob.mx" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xd="http://www.w3.org/2000/09/xmldsig#"><s:Header /><s:Body><des:SolicitaDescarga><des:solicitud FechaInicial="{{.FechaInicial}}" FechaFinal="{{.FechaFinal}}" RfcSolicitante="{{.RFCSolicitante}}" RfcEmisor="{{.RFCEmisor}}" TipoSolicitud="{{.TipoSolicitud}}"><Signature xmlns="http://www.w3.org/2000/09/xmldsig#"><SignedInfo><CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /><SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1" /><Reference URI=""><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>{{.Base64DigestValueXML}}</DigestValue></Reference></SignedInfo><SignatureValue>{{.Base64Signature}}</SignatureValue><KeyInfo><X509Data><X509IssuerSerial><X509IssuerName>{{.X509IssuerName}}</X509IssuerName><X509SerialNumber>{{.X509SerialNumber}}</X509SerialNumber></X509IssuerSerial><X509Certificate>{{.X509Certificate}}</X509Certificate></X509Data></KeyInfo></Signature></des:solicitud></des:SolicitaDescarga></s:Body></s:Envelope>